app/controllers/articles_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "articles"], ["description", "create articles\r\n"], ["created_at", "2020-07-20 07:32:12.865776"], ["updated_at", "2020-07-20 07:32:12.865776"], ["user_id", 1]]
---
	def create
		@article = Article.new(article_params)
		@article.user = User.first
		if @article.save