app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Richard George Padua"], ["password_digest", "$2a$12$2Id8ae7h9CEDIVbhHuUikeu7CCDZ712xPvBIm3ni1UuJnnScRgDWG"], ["updated_at", "2020-07-20 11:42:02.252803"], ["id", 5]]
---
	def update
		@user = User.find(params[:id])
		if @user.update(user_params)